
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>消息队列高手课 · 码上有为</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="oubindo">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="ElasticSearch快速入门.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://mp.weixin.qq.com/s/RnGl2FntihqrK0g2mb2aWw" target="_blank" class="custom-link">公众号:码上有为</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    后端
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" >
            
                <span>
            
                    
                    中间件
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1.1" data-path="Redis设计与实现.html">
            
                <a href="Redis设计与实现.html">
            
                    
                    Redis的设计与实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.1.2" data-path="ElasticSearch快速入门.html">
            
                <a href="ElasticSearch快速入门.html">
            
                    
                    ElasticSearch轻松入门
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.1.3" data-path="消息队列高手课.html">
            
                <a href="消息队列高手课.html">
            
                    
                    消息队列高手课
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2.2" >
            
                <span>
            
                    
                    存储
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.2.1" >
            
                <span>
            
                    
                    【WIP】mysql
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >消息队列高手课</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6D88;&#x606F;&#x961F;&#x5217;&#x9AD8;&#x624B;&#x8BFE;">&#x6D88;&#x606F;&#x961F;&#x5217;&#x9AD8;&#x624B;&#x8BFE;</h1>
<blockquote>
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x662F;&#x6211;&#x5B66;&#x4E60;&#x6781;&#x5BA2;&#x65F6;&#x95F4;&#x300A;&#x6D88;&#x606F;&#x961F;&#x5217;&#x9AD8;&#x624B;&#x8BFE;&#x300B;&#x7684;&#x7B14;&#x8BB0;&#x3002;</p>
</blockquote>
<h3 id="&#x4E00;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x6D88;&#x606F;&#x961F;&#x5217;">&#x4E00;.&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x6D88;&#x606F;&#x961F;&#x5217;</h3>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x6B3E;&#x53CA;&#x683C;&#x7684;&#x6D88;&#x606F;&#x961F;&#x5217;&#x4EA7;&#x54C1;&#xFF0C;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x7684;&#x51E0;&#x4E2A;&#x7279;&#x6027;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x6D88;&#x606F;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x9012;&#xFF1A;&#x786E;&#x4FDD;&#x4E0D;&#x4E22;&#x6D88;&#x606F;&#xFF1B;</li>
<li>Cluster&#xFF1A;&#x652F;&#x6301;&#x96C6;&#x7FA4;&#xFF0C;&#x786E;&#x4FDD;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x5BFC;&#x81F4;&#x670D;&#x52A1;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x4E0D;&#x80FD;&#x4E22;&#x6D88;&#x606F;&#xFF1B;</li>
<li>&#x6027;&#x80FD;&#xFF1A;&#x5177;&#x5907;&#x8DB3;&#x591F;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x80FD;&#x6EE1;&#x8DB3;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x573A;&#x666F;&#x7684;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x3002;</li>
</ul>
<p>&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x7684;&#x6D88;&#x606F;&#x961F;&#x5217;&#x4EA7;&#x54C1;&#x6709;</p>
<ol>
<li>RabbitMQ<ul>
<li>&#x4F18;&#x70B9;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x7279;&#x8272;&#x7684;Exchange&#x4EA4;&#x6362;&#x673A;&#x6A21;&#x5757;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x914D;&#x7F6E;&#x7684;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#x5C06;&#x751F;&#x4EA7;&#x8005;&#x53D1;&#x51FA;&#x7684;&#x6D88;&#x606F;&#x5206;&#x53D1;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x961F;&#x5217;&#x4E2D;&#x3002;</li>
<li>&#x7F3A;&#x70B9;&#x662F;&#x5BF9;&#x6D88;&#x606F;&#x5806;&#x79EF;&#x7684;&#x652F;&#x6301;&#x4E0D;&#x597D;&#xFF0C;&#x5F53;&#x5927;&#x91CF;&#x6D88;&#x606F;&#x5806;&#x79EF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6027;&#x80FD;&#x4F1A;&#x6025;&#x5267;&#x4E0B;&#x964D;&#xFF1B;&#x6027;&#x80FD;&#x6700;&#x5DEE;</li>
</ul>
</li>
<li>RocketMQ<ul>
<li>&#x4F18;&#x70B9;&#x662F;&#x6709;&#x4E0D;&#x9519;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x7A33;&#x5B9A;&#x6027;&#x548C;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x793E;&#x533A;&#x6D3B;&#x8DC3;&#xFF1B;&#x9002;&#x7528;&#x4E8E;&#x5728;&#x7EBF;&#x4E1A;&#x52A1;</li>
<li>&#x7F3A;&#x70B9;&#x662F;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x96C6;&#x6210;&#x548C;&#x517C;&#x5BB9;&#x7A0B;&#x5EA6;&#x7A0D;&#x900A;&#x4E00;&#x7B79;</li>
</ul>
</li>
<li>Kafka<ul>
<li>Kafka &#x4E0E;&#x5468;&#x8FB9;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x662F;&#x6700;&#x597D;&#x7684;&#x6CA1;&#x6709;&#x4E4B;&#x4E00;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x5927;&#x6570;&#x636E;&#x548C;&#x6D41;&#x8BA1;&#x7B97;&#x9886;&#x57DF;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x76F8;&#x5173;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x4F1A;&#x4F18;&#x5148;&#x652F;&#x6301; Kafka&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6279;&#x91CF;&#x548C;&#x5F02;&#x6B65;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x6240;&#x4EE5;&#x6027;&#x80FD;&#x5F88;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5BFC;&#x81F4;&#x540C;&#x6B65;&#x6536;&#x53D1;&#x6D88;&#x606F;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x5EF6;&#x6BD4;&#x8F83;&#x9AD8;</li>
<li>&#x9002;&#x7528;&#x4E8E;&#x79BB;&#x7EBF;&#x573A;&#x666F;</li>
</ul>
</li>
</ol>
<h3 id="&#x4E8C;&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x6A21;&#x578B;">&#x4E8C;.&#x53D1;&#x5E03;-&#x8BA2;&#x9605;&#x6A21;&#x578B;</h3>
<p>Kafka&#x548C;RocketMQ&#x90FD;&#x662F;&#x7528;&#x7684;&#x76F8;&#x540C;&#x7684;&#x6D88;&#x606F;&#x6A21;&#x578B;&#x3002;</p>
<p><img src="https://static001.geekbang.org/resource/image/d5/54/d5c0742113b2a6f5a419e1ffc3327354.jpg" alt="img"></p>
<p>&#x800C;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x5E76;&#x53D1;&#x751F;&#x4EA7;&#x548C;&#x6D88;&#x8D39;&#xFF0C;&#x5728;&#x4E3B;&#x9898;&#x91CC;&#x9762;&#x65B0;&#x589E;&#x4E86;&#x961F;&#x5217;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x4E3B;&#x9898;&#x548C;&#x961F;&#x5217;&#x7684;&#x5173;&#x7CFB;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x591A;&#x4E2A;&#x961F;&#x5217;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x5728;&#x5411;&#x4E3B;&#x9898;&#x751F;&#x4EA7;&#x6D88;&#x606F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x53EF;&#x80FD;&#x4F1A;&#x8FDB;&#x5165;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x62E5;&#x6709;&#x591A;&#x4E2A;&#x961F;&#x5217;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x5C31;&#x53EF;&#x4EE5;&#x4EE5;&#x5E76;&#x53D1;&#x751F;&#x4EA7;&#x7684;&#x65B9;&#x5F0F;&#x52A0;&#x5927;&#x751F;&#x4EA7;&#x901F;&#x5EA6;&#x3002;</li>
<li>&#x800C;&#x6D88;&#x8D39;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x91C7;&#x7528;&#x4E86;&#x6D88;&#x8D39;&#x7EC4;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x6D88;&#x8D39;&#x7EC4;&#x5F7C;&#x6B64;&#x4E4B;&#x95F4;&#x4E92;&#x4E0D;&#x5F71;&#x54CD;&#x3002;topic&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x961F;&#x5217;&#x90FD;&#x4F1A;&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x6D88;&#x8D39;&#x7EC4;&#x5728;&#x8FD9;&#x4E2A;&#x961F;&#x5217;&#x4E0A;&#x7684;&#x6D88;&#x8D39;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x6837;&#x6BCF;&#x4E2A;&#x6D88;&#x8D39;&#x7EC4;&#x90FD;&#x80FD;&#x6D88;&#x8D39;&#x5B8C;topic&#x91CC;&#x9762;&#x6240;&#x6709;&#x961F;&#x5217;&#x7684;&#x6D88;&#x606F;&#x3002;</li>
<li>&#x6D88;&#x8D39;&#x7EC4;&#x91CC;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#xFF0C;&#x8FD9;&#x4E9B;&#x6D88;&#x8D39;&#x8005;&#x5BF9;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x662F;&#x7ADE;&#x4E89;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x7684;&#x6D88;&#x8D39;&#x4E86;&#x3002;</li>
</ul>
<p><img src="https://static001.geekbang.org/resource/image/46/17/465142ab5b5096f283118c307e8cc117.jpg" alt="img"></p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x961F;&#x5217;&#xFF0C;&#x5728;rocketmq&#x4E2D;&#x5BF9;&#x5E94;MessageQueue&#xFF0C;&#x5728;kafka&#x4E2D;&#x5BF9;&#x5E94;Partition&#x3002;</p>
<h3 id="&#x4E09;&#x4E8B;&#x52A1;&#x6D88;&#x606F;">&#x4E09;.&#x4E8B;&#x52A1;&#x6D88;&#x606F;</h3>
<p>&#x6D88;&#x606F;&#x91CD;&#x8BD5;&#x673A;&#x5236;&#xFF1A;&#x82E5;Consumer&#x6D88;&#x8D39;&#x67D0;&#x6761;&#x6D88;&#x606F;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x6D88;&#x606F;&#x961F;&#x5217;RocketMQ&#x7248;&#x4F1A;&#x5728;&#x91CD;&#x8BD5;&#x95F4;&#x9694;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x5C06;&#x6D88;&#x606F;&#x91CD;&#x65B0;&#x6295;&#x9012;&#x7ED9;Consumer&#x6D88;&#x8D39;&#xFF0C;&#x82E5;&#x8FBE;&#x5230;&#x6700;&#x5927;&#x91CD;&#x8BD5;&#x6B21;&#x6570;&#x540E;&#x6D88;&#x606F;&#x8FD8;&#x6CA1;&#x6709;&#x6210;&#x529F;&#x88AB;&#x6D88;&#x8D39;&#xFF0C;&#x5219;&#x6D88;&#x606F;&#x5C06;&#x88AB;&#x6295;&#x9012;&#x81F3;<a href="https://help.aliyun.com/document_detail/87277.htm#concept-2047154" target="_blank">&#x6B7B;&#x4FE1;&#x961F;&#x5217;</a></p>
<p>&#x5728;&#x67D0;&#x4E9B;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;<strong>&#x53D1;&#x6D88;&#x606F;</strong>&#x53CA;<strong>&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;</strong>&#x8FBE;&#x5230;<strong>&#x540C;&#x65F6;&#x6210;&#x529F;&#xFF0C;&#x6216;&#x8005;&#x540C;&#x65F6;&#x5931;&#x8D25;</strong>&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x9700;&#x8981;&#x4F7F;&#x7528;<strong>&#x4E8B;&#x52A1;&#x6D88;&#x606F;</strong>&#x3002;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x662F;&#x521B;&#x5EFA;&#x8BA2;&#x5355;&#x540E;&#xFF0C;&#x53D1;&#x6D88;&#x606F;&#x6E05;&#x9664;&#x8D2D;&#x7269;&#x8F66;&#x4E2D;&#x7684;&#x5546;&#x54C1;&#x3002;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x7684;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x8D25;&#x3002;</p>
<ul>
<li>&#x5982;&#x679C;&#x5148;&#x53D1;&#x6D88;&#x606F;&#xFF0C;&#x521B;&#x5EFA;&#x8BA2;&#x5355;&#x53EF;&#x80FD;&#x5931;&#x8D25;&#xFF0C;&#x4F46;&#x662F;&#x5546;&#x54C1;&#x5DF2;&#x7ECF;&#x88AB;&#x5220;&#x9664;&#x4E86;</li>
<li>&#x5982;&#x679C;&#x5148;&#x521B;&#x5EFA;&#x8BA2;&#x5355;&#xFF0C;&#x5219;&#x53D1;&#x6D88;&#x606F;&#x53EF;&#x80FD;&#x5931;&#x8D25;&#xFF0C;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x5220;&#x9664;&#x5546;&#x54C1;</li>
</ul>
<p>&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E8B;&#x52A1;&#x6D88;&#x606F;&#x3002;&#x5148;&#x53D1;&#x9001;&#x4E00;&#x6761;half&#x6D88;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x521B;&#x5EFA;&#x8BA2;&#x5355;&#xFF0C;&#x518D;&#x6839;&#x636E;&#x8BA2;&#x5355;&#x521B;&#x5EFA;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x6D88;&#x606F;&#x6216;&#x8005;&#x56DE;&#x6EDA;&#x3002;</p>
<p><img src="https://static001.geekbang.org/resource/image/11/7a/11ea249b164b893fb9c36e86ae32577a.jpg" alt="img"></p>
<p>&#x5F53;&#x7B2C;&#x56DB;&#x6B65;&#xFF0C;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x6D88;&#x606F;&#x548C;&#x56DE;&#x6EDA;&#x5931;&#x8D25;&#x540E;&#xFF0C;kafka&#x4F1A;&#x76F4;&#x63A5;&#x5931;&#x8D25;&#xFF0C;&#x800C;rocketmq&#x4F1A;&#x5B9A;&#x65F6;&#x8FDB;&#x884C;&#x4E8B;&#x52A1;&#x53CD;&#x67E5;&#xFF0C;&#x9700;&#x8981;&#x4E1A;&#x52A1;&#x65B9;&#x63D0;&#x4F9B;&#x53CD;&#x67E5;&#x63A5;&#x53E3;&#xFF0C;&#x67E5;&#x8BE2;&#x7B2C;&#x4E8C;&#x6B65;&#x662F;&#x5426;&#x6267;&#x884C;&#x6210;&#x529F;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5224;&#x65AD;&#x662F;&#x63D0;&#x4EA4;&#x8FD8;&#x662F;&#x56DE;&#x6EDA;&#x3002;</p>
<h3 id="&#x56DB;&#x5982;&#x4F55;&#x786E;&#x4FDD;&#x6D88;&#x606F;&#x4E0D;&#x4E22;&#x5931;">&#x56DB;.&#x5982;&#x4F55;&#x786E;&#x4FDD;&#x6D88;&#x606F;&#x4E0D;&#x4E22;&#x5931;</h3>
<p>&#x4E00;&#x6761;&#x6D88;&#x606F;&#x4ECE;&#x751F;&#x4EA7;&#x5230;&#x6D88;&#x8D39;&#x5B8C;&#x6210;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#x3002;</p>
<p><img src="https://static001.geekbang.org/resource/image/81/05/81a01f5218614efea2838b0808709205.jpg" alt="img"></p>
<ul>
<li>&#x751F;&#x4EA7;&#x9636;&#x6BB5;: &#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x4ECE;&#x6D88;&#x606F;&#x5728; Producer &#x521B;&#x5EFA;&#x51FA;&#x6765;&#xFF0C;&#x7ECF;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x53D1;&#x9001;&#x5230; Broker &#x7AEF;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x9636;&#x6BB5;: &#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x6D88;&#x606F;&#x5728; Broker &#x7AEF;&#x5B58;&#x50A8;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x96C6;&#x7FA4;&#xFF0C;&#x6D88;&#x606F;&#x4F1A;&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x88AB;&#x590D;&#x5236;&#x5230;&#x5176;&#x4ED6;&#x7684;&#x526F;&#x672C;&#x4E0A;&#x3002;</li>
<li>&#x6D88;&#x8D39;&#x9636;&#x6BB5;: &#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;Consumer &#x4ECE; Broker &#x4E0A;&#x62C9;&#x53D6;&#x6D88;&#x606F;&#xFF0C;&#x7ECF;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x53D1;&#x9001;&#x5230; Consumer &#x4E0A;&#x3002;</li>
</ul>
<p>&#x751F;&#x4EA7;&#x9636;&#x6BB5;&#x6D88;&#x606F;&#x961F;&#x5217;&#x91C7;&#x7528;&#x6700;&#x5E38;&#x7528;&#x7684;&#x8BF7;&#x6C42;&#x786E;&#x8BA4;&#x673A;&#x5236;&#xFF0C;&#x6765;&#x4FDD;&#x8BC1;&#x6D88;&#x606F;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x9012;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x628A;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;Broker&#xFF0C;Broker&#x53D7;&#x5230;&#x6D88;&#x606F;&#x540E;&#xFF0C;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x4E00;&#x4E2A;&#x786E;&#x8BA4;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x5B58;&#x50A8;&#x9636;&#x6BB5;&#xFF0C;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x539F;&#x56E0;&#x662F;Broker&#x51FA;&#x73B0;&#x6545;&#x969C;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x914D;&#x7F6E;Broker&#x53C2;&#x6570;&#x6765;&#x907F;&#x514D;&#x5B95;&#x673A;&#x4E22;&#x6D88;&#x606F;&#x3002;&#x5982;&#x679C;&#x662F;&#x5355;&#x673A;&#x6A21;&#x5F0F;Broker&#xFF0C;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x5237;&#x76D8;&#x65B9;&#x5F0F;flushDiskType&#x914D;&#x7F6E;&#x4E3A;SYNC_FLUSH&#x540C;&#x6B65;&#x5237;&#x76D8;&#xFF0C;&#x5C06;&#x6D88;&#x606F;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x540E;&#x518D;&#x7ED9;Producer&#x8FD4;&#x56DE;&#x786E;&#x8BA4;&#x54CD;&#x5E94;&#x3002;&#x5982;&#x679C;Broker&#x662F;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x7EC4;&#x6210;&#x7684;&#x96C6;&#x7FA4;&#xFF0C;&#x62E5;&#x6709;&#x591A;&#x4E2A;master&#x548C;slave&#xFF0C;&#x90A3;&#x4E48;&#x5219;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x5199;&#x5165;&#x4E24;&#x4E2A;&#x4E3B;&#x8282;&#x70B9;&#x6210;&#x529F;&#x4EE5;&#x540E;&#x624D;&#x8FD4;&#x56DE;&#x786E;&#x8BA4;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x6D88;&#x8D39;&#x9636;&#x6BB5;&#x91C7;&#x7528;&#x4E86;&#x548C;&#x751F;&#x4EA7;&#x9636;&#x6BB5;&#x7C7B;&#x4F3C;&#x7684;&#x786E;&#x8BA4;&#x673A;&#x5236;&#x6765;&#x4FDD;&#x8BC1;&#x6D88;&#x606F;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x9012;&#x3002;</p>
<h3 id="&#x4E94;&#x5982;&#x4F55;&#x5904;&#x7406;&#x6D88;&#x8D39;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x91CD;&#x590D;&#x6D88;&#x606F;">&#x4E94;.&#x5982;&#x4F55;&#x5904;&#x7406;&#x6D88;&#x8D39;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x91CD;&#x590D;&#x6D88;&#x606F;</h3>
<p>&#x6D88;&#x606F;&#x91CD;&#x590D;&#x7684;&#x60C5;&#x51B5;&#x5FC5;&#x7136;&#x5B58;&#x5728;&#x3002;&#x5728; MQTT &#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x7ED9;&#x51FA;&#x4E86;&#x4E09;&#x79CD;&#x4F20;&#x9012;&#x6D88;&#x606F;&#x65F6;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#x6807;&#x51C6;&#xFF0C;&#x8FD9;&#x4E09;&#x79CD;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#x4ECE;&#x4F4E;&#x5230;&#x9AD8;&#x4F9D;&#x6B21;&#x662F;&#xFF1A;</p>
<ul>
<li>At most once: &#x81F3;&#x591A;&#x4E00;&#x6B21;&#x3002;&#x6D88;&#x606F;&#x5728;&#x4F20;&#x9012;&#x65F6;&#xFF0C;&#x6700;&#x591A;&#x4F1A;&#x88AB;&#x9001;&#x8FBE;&#x4E00;&#x6B21;&#x3002;&#x6362;&#x4E00;&#x4E2A;&#x8BF4;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x6D88;&#x606F;&#x53EF;&#x9760;&#x6027;&#x4FDD;&#x8BC1;&#xFF0C;&#x5141;&#x8BB8;&#x4E22;&#x6D88;&#x606F;&#x3002;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x5BF9;&#x6D88;&#x606F;&#x53EF;&#x9760;&#x6027;&#x8981;&#x6C42;&#x4E0D;&#x592A;&#x9AD8;&#x7684;&#x76D1;&#x63A7;&#x573A;&#x666F;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x6BCF;&#x5206;&#x949F;&#x4E0A;&#x62A5;&#x4E00;&#x6B21;&#x673A;&#x623F;&#x6E29;&#x5EA6;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x6570;&#x636E;&#x5C11;&#x91CF;&#x4E22;&#x5931;&#x3002;</li>
<li>At least once: &#x81F3;&#x5C11;&#x4E00;&#x6B21;&#x3002;&#x6D88;&#x606F;&#x5728;&#x4F20;&#x9012;&#x65F6;&#xFF0C;&#x81F3;&#x5C11;&#x4F1A;&#x88AB;&#x9001;&#x8FBE;&#x4E00;&#x6B21;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x4E22;&#x6D88;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x5141;&#x8BB8;&#x6709;&#x5C11;&#x91CF;&#x91CD;&#x590D;&#x6D88;&#x606F;&#x51FA;&#x73B0;&#x3002;</li>
<li>Exactly once&#xFF1A;&#x6070;&#x597D;&#x4E00;&#x6B21;&#x3002;&#x6D88;&#x606F;&#x5728;&#x4F20;&#x9012;&#x65F6;&#xFF0C;&#x53EA;&#x4F1A;&#x88AB;&#x9001;&#x8FBE;&#x4E00;&#x6B21;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x4E22;&#x5931;&#x4E5F;&#x4E0D;&#x5141;&#x8BB8;&#x91CD;&#x590D;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x6700;&#x9AD8;&#x7684;&#x7B49;&#x7EA7;&#x3002;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x6D88;&#x606F;&#x961F;&#x5217;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#x90FD;&#x662F;at least once&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x91CD;&#x590D;&#x6D88;&#x606F;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5728;&#x6D88;&#x8D39;&#x7AEF;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6D88;&#x8D39;&#x6D88;&#x606F;&#x7684;&#x64CD;&#x4F5C;&#x5177;&#x6709;<strong>&#x5E42;&#x7B49;&#x6027;</strong>&#x3002;&#x6709;&#x51E0;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x5E42;&#x7B49;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ol>
<li>&#x5229;&#x7528;<strong>&#x6570;&#x636E;&#x5E93;&#x7684;&#x552F;&#x4E00;&#x7EA6;&#x675F;</strong>&#x5B9E;&#x73B0;&#x5E42;&#x7B49;&#x3002;&#x6BD4;&#x5982;mysql&#x7684;insert if not exist&#xFF0C;&#x6216;&#x8005;redis&#x7684;setnx&#x547D;&#x4EE4;&#x3002;</li>
<li>&#x4E3A;&#x66F4;&#x65B0;&#x7684;&#x6570;&#x636E;<strong>&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x524D;&#x7F6E;&#x6761;&#x4EF6;</strong>&#xFF0C;&#x5982;&#x679C;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x5C31;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x3002;&#x6BD4;&#x5982;&#x7ED9;&#x6570;&#x636E;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x53F7;&#x5C5E;&#x6027;&#xFF0C;&#x6BCF;&#x6B21;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x524D;&#xFF0C;&#x6BD4;&#x8F83;&#x5F53;&#x524D;&#x6570;&#x636E;&#x7684;&#x7248;&#x672C;&#x53F7;&#x662F;&#x5426;&#x548C;&#x6D88;&#x606F;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x53F7;&#x4E00;&#x81F4;&#xFF0C;&#x4E0D;&#x4E00;&#x81F4;&#x5C31;&#x62D2;&#x7EDD;&#x66F4;&#x65B0;&#x3002;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x7684;&#x540C;&#x65F6;&#x5C06;&#x7248;&#x672C;&#x53F7;+1</li>
<li>&#x901A;&#x7528;&#x6027;&#x6700;&#x5F3A;&#x7684;&#x5E42;&#x7B49;&#x65B9;&#x6CD5;&#xFF1A;<strong>&#x8BB0;&#x5F55;&#x5E76;&#x68C0;&#x67E5;&#x64CD;&#x4F5C;</strong>&#x3002;&#x5728;&#x6267;&#x884C;&#x6570;&#x636E;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x662F;&#x5426;&#x6267;&#x884C;&#x8FC7;&#x8FD9;&#x4E2A;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#x7ED9;&#x6BCF;&#x6761;&#x6D88;&#x606F;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x552F;&#x4E00;&#x7684;ID&#xFF0C;&#x6D88;&#x8D39;&#x65F6;&#x6839;&#x636E;id&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6709;&#x88AB;&#x6D88;&#x8D39;&#x8FC7;&#x3002;</li>
</ol>
<h3 id="&#x516D;kafka&#x662F;&#x5982;&#x4F55;&#x63D0;&#x5347;&#x6027;&#x80FD;&#x7684;">&#x516D;.Kafka&#x662F;&#x5982;&#x4F55;&#x63D0;&#x5347;&#x6027;&#x80FD;&#x7684;</h3>
<p>kafka&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x79BB;&#x7EBF;&#x6570;&#x636E;&#x6D41;&#x573A;&#x666F;&#xFF0C;&#x6027;&#x80FD;&#x975E;&#x5E38;&#x597D;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x505A;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>1.<strong>&#x4F7F;&#x7528;&#x6279;&#x91CF;&#x6D88;&#x606F;&#x63D0;&#x5347;&#x670D;&#x52A1;&#x7AEF;&#x5904;&#x7406;&#x80FD;&#x529B;</strong>&#x3002;</p>
<p>&#x53D1;&#x9001;&#x7AEF;&#x53EA;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;send()&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x5B9E;&#x9ED8;&#x8BA4;&#x662F;&#x5C06;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x5148;&#x653E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x5408;&#x9002;&#x65F6;&#x673A;&#x5C06;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6D88;&#x606F;&#x7EC4;&#x6210;&#x4E00;&#x6279;&#xFF0C;&#x4E00;&#x6B21;&#x6027;&#x53D1;&#x7ED9;broker&#x3002;broker&#x5728;&#x63A5;&#x6536;&#x5230;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x540E;&#xFF0C;&#x4E0D;&#x662F;&#x62C6;&#x5206;&#x6210;&#x4E00;&#x6761;&#x4E00;&#x6761;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x6279;&#x91CF;&#x5904;&#x7406;&#xFF0C;&#x628A;&#x4E00;&#x6279;&#x6D88;&#x606F;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x201C;&#x6279;&#x6D88;&#x606F;&#x201D;&#x6765;&#x5904;&#x7406;&#x3002;&#x800C;&#x6D88;&#x8D39;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x662F;consumer&#x4ECE;broker&#x62C9;&#x5230;&#x4E00;&#x6279;&#x6D88;&#x606F;&#x540E;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x628A;&#x6279;&#x6D88;&#x606F;&#x89E3;&#x5F00;&#xFF0C;&#x518D;&#x4E00;&#x6761;&#x4E00;&#x6761;&#x4EA4;&#x7ED9;&#x7528;&#x6237;&#x4EE3;&#x7801;&#x5904;&#x7406;&#x3002;</p>
<p>2.<strong>&#x4F7F;&#x7528;&#x987A;&#x5E8F;&#x8BFB;&#x5199;&#x63D0;&#x5347;&#x78C1;&#x76D8;IO&#x6027;&#x80FD;</strong></p>
<p>&#x5BF9;&#x4E8E;&#x78C1;&#x76D8;&#x6765;&#x8BF4;&#xFF0C;&#x987A;&#x5E8F;&#x8BFB;&#x5199;&#x6BD4;&#x968F;&#x673A;&#x8BFB;&#x5199;&#x7701;&#x53BB;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x7684;&#x5BFB;&#x5740;&#x65F6;&#x95F4;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5BFB;&#x5740;&#x4E00;&#x6B21;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8FDE;&#x7EED;&#x7684;&#x8BFB;&#x5199;&#x4E0B;&#x53BB;&#xFF0C;&#x6240;&#x4EE5;&#x6027;&#x80FD;&#x597D;&#x5F88;&#x591A;&#x3002;Kafka &#x5C31;&#x662F;&#x5145;&#x5206;&#x5229;&#x7528;&#x4E86;&#x78C1;&#x76D8;&#x7684;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x3002;&#x5B83;&#x7684;&#x5B58;&#x50A8;&#x8BBE;&#x8BA1;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#xFF0C;&#x5B83;&#x628A;&#x4ECE; Producer &#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x987A;&#x5E8F;&#x5730;&#x5199;&#x5165;&#x5BF9;&#x5E94;&#x7684; log &#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5199;&#x6EE1;&#x4E86;&#xFF0C;&#x5C31;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6587;&#x4EF6;&#x8FD9;&#x6837;&#x987A;&#x5E8F;&#x5199;&#x4E0B;&#x53BB;&#x3002;&#x6D88;&#x8D39;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x662F;&#x4ECE;&#x67D0;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x67D0;&#x4E00;&#x4E2A; log &#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#xFF0C;&#x987A;&#x5E8F;&#x5730;&#x628A;&#x6D88;&#x606F;&#x8BFB;&#x51FA;&#x6765;&#x3002;</p>
<p>3.<strong>&#x5229;&#x7528;page cache&#x52A0;&#x901F;&#x6D88;&#x606F;&#x8BFB;&#x5199;</strong></p>
<p><a href="https://cloud.tencent.com/developer/article/1778812" target="_blank">&#x57FA;&#x4E8E;SSD&#x7684;Kafka&#x5E94;&#x7528;&#x5C42;&#x7F13;&#x5B58;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0E;&#x5B9E;&#x73B0;</a>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8BB2;&#x5F97;&#x5F88;&#x597D;&#x3002;</p>
<p><img src="https://cdn.jsdelivr.net/gh/oubindo/ImageBed@latest//img/20220115150604.png" alt=""></p>
<p>&#x5BF9;&#x4E8E;Produce&#x8BF7;&#x6C42;&#xFF1A;Server&#x7AEF;&#x7684;I/O&#x7EBF;&#x7A0B;&#x7EDF;&#x4E00;&#x5C06;&#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5199;&#x5165;&#x5230;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;PageCache&#x540E;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#xFF0C;&#x5F53;&#x6D88;&#x606F;&#x6761;&#x6570;&#x5230;&#x8FBE;&#x4E00;&#x5B9A;&#x9608;&#x503C;&#x540E;&#xFF0C;Kafka&#x5E94;&#x7528;&#x672C;&#x8EAB;&#x6216;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x4F1A;&#x89E6;&#x53D1;&#x5F3A;&#x5236;&#x5237;&#x76D8;&#x64CD;&#x4F5C;&#xFF08;&#x5982;&#x5DE6;&#x4FA7;&#x6D41;&#x7A0B;&#x56FE;&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;Consume&#x8BF7;&#x6C42;&#xFF1A;&#x4E3B;&#x8981;&#x5229;&#x7528;&#x4E86;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;ZeroCopy&#x673A;&#x5236;&#xFF0C;&#x5F53;Kafka Broker&#x63A5;&#x6536;&#x5230;&#x8BFB;&#x6570;&#x636E;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x4F1A;&#x5411;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53D1;&#x9001;sendfile&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63A5;&#x6536;&#x540E;&#xFF0C;&#x9996;&#x5148;&#x8BD5;&#x56FE;&#x4ECE;PageCache&#x4E2D;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF08;&#x5982;&#x4E2D;&#x95F4;&#x6D41;&#x7A0B;&#x56FE;&#x6240;&#x793A;&#xFF09;&#xFF1B;&#x5982;&#x679C;&#x6570;&#x636E;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x4F1A;&#x89E6;&#x53D1;&#x7F3A;&#x9875;&#x5F02;&#x5E38;&#x4E2D;&#x65AD;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x78C1;&#x76D8;&#x8BFB;&#x5165;&#x5230;&#x4E34;&#x65F6;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#xFF08;&#x5982;&#x53F3;&#x4FA7;&#x6D41;&#x7A0B;&#x56FE;&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x968F;&#x540E;&#x901A;&#x8FC7;DMA&#x64CD;&#x4F5C;&#x76F4;&#x63A5;&#x5C06;&#x6570;&#x636E;&#x62F7;&#x8D1D;&#x5230;&#x7F51;&#x5361;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7B49;&#x5F85;&#x540E;&#x7EED;&#x7684;TCP&#x4F20;&#x8F93;&#x3002;</p>
<p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;Kafka&#x5BF9;&#x4E8E;&#x5355;&#x4E00;&#x8BFB;&#x5199;&#x8BF7;&#x6C42;&#x5747;&#x62E5;&#x6709;&#x5F88;&#x597D;&#x7684;&#x541E;&#x5410;&#x548C;&#x5EF6;&#x8FDF;&#x3002;&#x5904;&#x7406;&#x5199;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5199;&#x5165;PageCache&#x540E;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#xFF0C;&#x6570;&#x636E;&#x901A;&#x8FC7;&#x5F02;&#x6B65;&#x65B9;&#x5F0F;&#x6279;&#x91CF;&#x5237;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x65E2;&#x4FDD;&#x8BC1;&#x4E86;&#x591A;&#x6570;&#x5199;&#x8BF7;&#x6C42;&#x90FD;&#x80FD;&#x6709;&#x8F83;&#x4F4E;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#x540C;&#x65F6;&#x6279;&#x91CF;&#x987A;&#x5E8F;&#x5237;&#x76D8;&#x5BF9;&#x78C1;&#x76D8;&#x66F4;&#x52A0;&#x53CB;&#x597D;&#x3002;&#x5904;&#x7406;&#x8BFB;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5B9E;&#x65F6;&#x6D88;&#x8D39;&#x7684;&#x4F5C;&#x4E1A;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;PageCache&#x8BFB;&#x53D6;&#x5230;&#x6570;&#x636E;&#xFF0C;&#x8BF7;&#x6C42;&#x5EF6;&#x8FDF;&#x8F83;&#x5C0F;&#xFF0C;&#x540C;&#x65F6;ZeroCopy&#x673A;&#x5236;&#x80FD;&#x591F;&#x51CF;&#x5C11;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x7528;&#x6237;&#x6001;&#x4E0E;&#x5185;&#x6838;&#x6001;&#x7684;&#x5207;&#x6362;&#xFF0C;&#x5927;&#x5E45;&#x63D0;&#x5347;&#x4E86;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x6548;&#x7387;&#x3002;</p>
<h3 id="&#x4E03;kafka&#x548C;rmq&#x6D88;&#x606F;&#x590D;&#x5236;&#x7684;&#x533A;&#x522B;">&#x4E03;.kafka&#x548C;rmq&#x6D88;&#x606F;&#x590D;&#x5236;&#x7684;&#x533A;&#x522B;</h3>
<p><strong>rmq&#xFF1A;Broker&#x4E3A;&#x590D;&#x5236;&#x5355;&#x4F4D;</strong></p>
<p>&#x5728;2018&#x5E74;&#x524D;&#xFF0C;rmq&#x662F;&#x91C7;&#x7528;&#x4E3B;&#x4ECE;&#x5F02;&#x6B65;&#x590D;&#x5236;&#xFF0C;&#x91C7;&#x7528;&#x591A;&#x4E3B;&#x4ECE;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x707E;&#x5907;&#xFF0C;&#x4E00;&#x4E2A;&#x4E3B;&#x6302;&#x4E86;&#xFF0C;&#x5C31;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x591A;&#x4E3B;&#x4ECE;&#x6A21;&#x5F0F;&#x6CA1;&#x529E;&#x6CD5;&#x540C;&#x65F6;&#x89E3;&#x51B3;&#x4E25;&#x683C;&#x987A;&#x5E8F;&#x548C;&#x53EF;&#x7528;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5728;2018&#x5E74;&#x5E95;&#xFF0C;rmq&#x8FCE;&#x6765;&#x4E86;&#x91CD;&#x5927;&#x66F4;&#x65B0;&#x3002;&#x4ED6;&#x5F15;&#x5165;&#x4E86;Deldger&#xFF0C;&#x4FEE;&#x6539;&#x4E86;&#x590D;&#x5236;&#x65B9;&#x5F0F;&#x3002;</p>
<ul>
<li>&#x9996;&#x5148;&#xFF0C;Dledger &#x5728;&#x5199;&#x5165;&#x6D88;&#x606F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6C42;&#x81F3;&#x5C11;&#x6D88;&#x606F;&#x590D;&#x5236;&#x5230;&#x534A;&#x6570;&#x4EE5;&#x4E0A;&#x7684;&#x8282;&#x70B9;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x8FD4;&#x56DE;&#x5199;&#x5165;&#x6210;&#x529F;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x662F;&#x652F;&#x6301;&#x901A;&#x8FC7;&#x9009;&#x4E3E;&#x6765;&#x52A8;&#x6001;&#x5207;&#x6362;&#x4E3B;&#x8282;&#x70B9;&#x7684;&#x3002;</li>
<li>&#x5F53;&#x4E3B;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x7684;&#x65F6;&#x5019;&#xFF0C;2 &#x4E2A;&#x4ECE;&#x8282;&#x70B9;&#x4F1A;&#x901A;&#x8FC7;&#x6295;&#x7968;&#x9009;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#x6765;&#x7EE7;&#x7EED;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x76F8;&#x6BD4;&#x4E3B;&#x4ECE;&#x7684;&#x590D;&#x5236;&#x6A21;&#x5F0F;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x53EF;&#x7528;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7531;&#x4E8E;&#x6D88;&#x606F;&#x8981;&#x81F3;&#x5C11;&#x590D;&#x5236;&#x5230; 2 &#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x624D;&#x4F1A;&#x8FD4;&#x56DE;&#x5199;&#x5165;&#x6210;&#x529F;&#xFF0C;&#x5373;&#x4F7F;&#x4E3B;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x4E86;&#xFF0C;&#x4E5F;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x6D88;&#x606F;&#x662F;&#x548C;&#x4E3B;&#x8282;&#x70B9;&#x4E00;&#x6837;&#x7684;&#x3002;Dledger &#x5728;&#x9009;&#x4E3E;&#x65F6;&#xFF0C;&#x603B;&#x4F1A;&#x628A;&#x6570;&#x636E;&#x548C;&#x4E3B;&#x8282;&#x70B9;&#x4E00;&#x6837;&#x7684;&#x4ECE;&#x8282;&#x70B9;&#x9009;&#x4E3A;&#x65B0;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4FDD;&#x8BC1;&#x4E86;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x65E2;&#x4E0D;&#x4F1A;&#x4E22;&#x6D88;&#x606F;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4E25;&#x683C;&#x987A;&#x5E8F;&#x3002;</li>
</ul>
<p>&#x7F3A;&#x70B9;&#x662F;&#x56E0;&#x4E3A;deldger&#x590D;&#x5236;&#x65B9;&#x5F0F;&#xFF0C;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x4E09;&#x4E2A;&#x8282;&#x70B9;&#x624D;&#x80FD;&#x6EE1;&#x8DB3;&#x53EF;&#x7528;&#x6027;&#x8981;&#x6C42;&#x3002;&#x6240;&#x4EE5;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x4F1A;&#x8F83;&#x4F4E;&#x3002;</p>
<p><strong>kafka&#xFF1A;&#x4EE5;&#x5206;&#x533A;&#x4E3A;&#x590D;&#x5236;&#x5355;&#x4F4D;</strong></p>
<p>Kafka &#x4E2D;&#xFF0C;&#x590D;&#x5236;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x662F;&#x5206;&#x533A;&#x3002;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x51E0;&#x4E2A;&#x526F;&#x672C;&#x4E4B;&#x95F4;&#xFF0C;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x590D;&#x5236;&#x96C6;&#x7FA4;&#xFF0C;Broker &#x53EA;&#x662F;&#x8FD9;&#x4E9B;&#x5206;&#x533A;&#x526F;&#x672C;&#x7684;&#x5BB9;&#x5668;&#xFF0C;&#x6240;&#x4EE5; Kafka &#x7684; Broker &#x662F;&#x4E0D;&#x5206;&#x4E3B;&#x4ECE;&#x7684;&#x3002;</p>
<p>&#x5206;&#x533A;&#x7684;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x4E2D;&#x4E5F;&#x662F;&#x91C7;&#x7528;&#x4E00;&#x4E3B;&#x591A;&#x4ECE;&#x7684;&#x65B9;&#x5F0F;&#x3002;Kafka &#x5728;&#x5199;&#x5165;&#x6D88;&#x606F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x4E5F;&#x662F;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x6D88;&#x606F;&#x5728;&#x5199;&#x5165;&#x5230;&#x4E3B;&#x8282;&#x70B9;&#x4E4B;&#x540E;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x9A6C;&#x4E0A;&#x8FD4;&#x56DE;&#x5199;&#x5165;&#x6210;&#x529F;&#xFF0C;&#x800C;&#x662F;&#x7B49;&#x5F85;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x8282;&#x70B9;&#x90FD;&#x590D;&#x5236;&#x6210;&#x529F;&#x540E;&#x518D;&#x8FD4;&#x56DE;&#x3002;&#x8FD9;&#x4E2A;&#x5199;&#x5165;&#x8282;&#x70B9;&#x6570;&#xFF0C;&#x4EA4;&#x7ED9;&#x7528;&#x6237;&#x914D;&#x7F6E;&#x3002;</p>
<p>Kafka &#x4F7F;&#x7528; ZooKeeper &#x6765;&#x76D1;&#x63A7;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x67D0;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#x5B95;&#x673A;&#x4E86;&#xFF0C;Kafka &#x4F1A;&#x5229;&#x7528; ZooKeeper &#x6765;&#x9009;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x6837;&#x89E3;&#x51B3;&#x4E86;&#x53EF;&#x7528;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4F46;&#x662F;kafka&#x6CA1;&#x529E;&#x6CD5;&#x5B8C;&#x5168;&#x89E3;&#x51B3;&#x987A;&#x5E8F;&#x6D88;&#x606F;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<p>1.&#x5206;&#x533A;&#x53D8;&#x66F4;&#x3002;&#x5047;&#x8BBE;&#x6709;&#x96C6;&#x7FA4;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x4E3B;&#x9898; A&#xFF0C;&#x751F;&#x4EA7;&#x7AEF;&#x9700;&#x8981;&#x5F80;&#x5206;&#x533A; 1 &#x53D1;&#x9001; 3 &#x6761;&#x987A;&#x5E8F;&#x6D88;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x751F;&#x4EA7;&#x7AEF;&#x662F;&#x6839;&#x636E;&#x6D88;&#x606F; Key &#x53D6;&#x6A21;&#x8BA1;&#x7B97;&#x51B3;&#x5B9A;&#x6D88;&#x606F;&#x53D1;&#x5F80;&#x54EA;&#x4E2A;&#x5206;&#x533A;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6B64;&#x65F6;&#x751F;&#x4EA7;&#x7AEF;&#x53D1;&#x9001;&#x7B2C;&#x4E09;&#x6761;&#x6D88;&#x606F;&#x524D;&#xFF0C;&#x4E3B;&#x9898; A &#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#xFF0C;&#x751F;&#x4EA7;&#x7AEF;&#x6839;&#x636E; Key &#x53D6;&#x6A21;&#x5F97;&#x51FA;&#x7684;&#x5206;&#x533A;&#x53F7;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x7B2C;&#x4E09;&#x6761;&#x6D88;&#x606F;&#x8DEF;&#x7531;&#x5230;&#x5176;&#x5B83;&#x5206;&#x533A;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x8FD9;&#x4E09;&#x6761;&#x987A;&#x5E8F;&#x6D88;&#x606F;&#x5C31;&#x4E0D;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#x4E86;&#xFF0C;&#x6B64;&#x65F6;&#x5C31;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E09;&#x6761;&#x6D88;&#x606F;&#x7684;&#x6D88;&#x8D39;&#x987A;&#x5E8F;&#x4E86;&#x3002;</p>
<p>2.&#x5206;&#x533A;&#x4E0D;&#x53D8;&#x66F4;</p>
<ul>
<li>&#x5206;&#x533A;&#x5355;&#x526F;&#x672C;&#xFF1A;&#x8FD9;&#x79CD;&#x5355;&#x526F;&#x672C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x8FD9;&#x4E2A;&#x5206;&#x533A;&#x6240;&#x5728;&#x7684;broker&#x5B95;&#x673A;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5206;&#x533A;&#x5C31;&#x4E0D;&#x518D;&#x53EF;&#x7528;&#xFF0C;&#x751F;&#x4EA7;&#x7AEF;&#x5C31;&#x4F1A;&#x8DEF;&#x7531;&#x6D88;&#x606F;&#x5230;&#x522B;&#x7684;&#x5206;&#x533A;&#x3002;</li>
<li>&#x5206;&#x533A;&#x591A;&#x526F;&#x672C;&#xFF1A;&#x5F00;&#x542F;&#x5206;&#x533A;&#x591A;&#x526F;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x53D1;&#x9001;&#x7AEF;&#x5FC5;&#x987B;&#x6D88;&#x606F;&#x540C;&#x6B65;&#x5230;&#x5168;&#x90E8;&#x526F;&#x672C;&#x540E;&#x624D;&#x8FD4;&#x56DE;&#x53D1;&#x9001;&#x6210;&#x529F;&#x3002;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4E0A;&#x9762;&#x5206;&#x533A;&#x5355;&#x526F;&#x672C;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x4E3B;&#x5206;&#x533A;&#x6302;&#x4E86;&#xFF0C;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x9009;&#x4E3E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#x6D88;&#x606F;&#x88AB;&#x8DEF;&#x7531;&#x5230;&#x5176;&#x4ED6;&#x5206;&#x533A;&#x7684;&#x53EF;&#x80FD;&#x3002;</li>
</ul>
<h3 id="&#x516B;kafka&#x591A;&#x6D88;&#x8D39;&#x8005;&#x6A21;&#x578B;">&#x516B;.kafka&#x591A;&#x6D88;&#x8D39;&#x8005;&#x6A21;&#x578B;</h3>
<p>kafka &#x7684;&#x6D88;&#x8D39;&#x7C7B; KafkaConsumer &#x662F;&#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#x5171;&#x4EAB;&#x4E00;&#x4E2A; KafkaConsumer &#x5B9E;&#x4F8B;&#xFF0C;&#x4E14; KafkaConsumer &#x672C;&#x8EAB;&#x5E76;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x591A;&#x7EBF;&#x7A0B;&#x6D88;&#x8D39;&#x903B;&#x8F91;&#xFF0C;&#x5982;&#x9700;&#x591A;&#x7EBF;&#x7A0B;&#x6D88;&#x8D39;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x7528;&#x6237;&#x81EA;&#x884C;&#x5B9E;&#x73B0;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4F1A;&#x8BB2;&#x5230; Kafka &#x4E24;&#x79CD;&#x591A;&#x7EBF;&#x7A0B;&#x6D88;&#x8D39;&#x6A21;&#x578B;&#x3002;</p>
<p>1&#x3001;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A; KafkaConsumer</p>
<p>&#x8FD9;&#x6837;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5185;&#x62E5;&#x6709;&#x591A;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x6D88;&#x8D39;&#x7EC4;&#x5185;&#x6210;&#x5458;&#x662F;&#x6709;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5185;&#x7684; KafkaConsumer &#x7EC4;&#x6210;&#x7684;&#x3002;</p>
<p><img src="https://gitee.com/objcoding/md-picture/raw/master/img/20200426193745.png" alt="img"></p>
<p>&#x4F46;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x6D88;&#x8D39;&#x6A21;&#x578B;&#x662F;&#x5B58;&#x5728;&#x5F88;&#x5927;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x4ECE;&#x6D88;&#x8D39;&#x6D88;&#x8D39;&#x6A21;&#x578B;&#x53EF;&#x770B;&#x51FA;&#x6BCF;&#x4E2A; KafkaConsumer &#x4F1A;&#x8D1F;&#x8D23;&#x56FA;&#x5B9A;&#x7684;&#x5206;&#x533A;&#xFF0C;&#x56E0;&#x6B64;&#x65E0;&#x6CD5;&#x63D0;&#x5347;&#x5355;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x6D88;&#x8D39;&#x80FD;&#x529B;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x5206;&#x533A;&#x6570;&#x91CF;&#x5F88;&#x591A;&#xFF0C;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x589E;&#x52A0; KafkaConsumer &#x5B9E;&#x4F8B;&#x63D0;&#x9AD8;&#x6D88;&#x8D39;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x8FC7;&#x591A;&#xFF0C;&#x5BFC;&#x81F4;&#x9879;&#x76EE; Socket &#x8FDE;&#x63A5;&#x5F00;&#x9500;&#x5DE8;&#x5927;&#xFF0C;&#x9879;&#x76EE;&#x4E2D;&#x4E00;&#x822C;&#x4E0D;&#x7528;&#x8BE5;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#x53BB;&#x6D88;&#x8D39;&#x3002;</p>
<p>2&#x3001;&#x5355; KafkaConsumer &#x5B9E;&#x4F8B; + &#x591A; worker &#x7EBF;&#x7A0B;</p>
<p>&#x9488;&#x5BF9;&#x7B2C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x91C7;&#x53D6; KafkaConsumer &#x5B9E;&#x4F8B;&#x4E0E;&#x6D88;&#x606F;&#x6D88;&#x8D39;&#x903B;&#x8F91;&#x89E3;&#x8026;&#xFF0C;&#x628A;&#x6D88;&#x606F;&#x6D88;&#x8D39;&#x903B;&#x8F91;&#x653E;&#x5165;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x53BB;&#x5904;&#x7406;&#xFF0C;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="https://gitee.com/objcoding/md-picture/raw/master/img/20200426195213.png" alt="img"></p>
<p>&#x4ECE;&#x6D88;&#x8D39;&#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#x53EF;&#x770B;&#x51FA;&#xFF0C;&#x5F53; KafkaConsumer &#x5B9E;&#x4F8B;&#x4E0E;&#x6D88;&#x606F;&#x6D88;&#x8D39;&#x903B;&#x8F91;&#x89E3;&#x8026;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x591A;&#x4E2A; KafkaConsumer &#x5B9E;&#x4F8B;&#x5C31;&#x53EF;&#x8FDB;&#x884C;&#x591A;&#x7EBF;&#x7A0B;&#x6D88;&#x8D39;&#xFF0C;&#x8FD8;&#x53EF;&#x6839;&#x636E;&#x6D88;&#x8D39;&#x7684;&#x8D1F;&#x8F7D;&#x60C5;&#x51B5;&#x52A8;&#x6001;&#x8C03;&#x6574; worker &#x7EBF;&#x7A0B;&#xFF0C;&#x5177;&#x6709;&#x5F88;&#x5F3A;&#x7684;&#x72EC;&#x7ACB;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x6D88;&#x8D39;&#x6A21;&#x578B;&#x5C31;&#x662F;&#x7528;&#x7684;&#x5355; KafkaConsumer &#x5B9E;&#x4F8B; + &#x591A; worker &#x7EBF;&#x7A0B;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x4E2A;&#x6D88;&#x8D39;&#x6A21;&#x578B;&#x7531;&#x4E8E;&#x6D88;&#x8D39;&#x903B;&#x8F91;&#x662F;&#x5229;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x6D88;&#x8D39;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5E76;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5176;&#x6D88;&#x606F;&#x7684;&#x6D88;&#x8D39;&#x987A;&#x5E8F;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F15;&#x5165;&#x963B;&#x585E;&#x961F;&#x5217;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4E00;&#x4E2A; woker &#x7EBF;&#x7A0B;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x963B;&#x585E;&#x961F;&#x5217;&#xFF0C;&#x7EBF;&#x7A0B;&#x4E0D;&#x65AD;&#x8F6E;&#x8BAD;&#x4ECE;&#x963B;&#x585E;&#x961F;&#x5217;&#x4E2D;&#x83B7;&#x53D6;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x6D88;&#x8D39;&#xFF0C;&#x5BF9;&#x5177;&#x6709;&#x76F8;&#x540C; key &#x7684;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x53D6;&#x6A21;&#xFF0C;&#x5E76;&#x653E;&#x5165;&#x76F8;&#x540C;&#x7684;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x5B9E;&#x73B0;&#x987A;&#x5E8F;&#x6D88;&#x8D39;&#xFF0C; &#x6D88;&#x8D39;&#x6A21;&#x578B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="https://gitee.com/objcoding/md-picture/raw/master/img/20200426210045.png" alt="img"></p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x6D88;&#x8D39;&#x8005;rebalance&#x5BFC;&#x81F4;&#x6D88;&#x8D39;&#x8005;&#x5F53;&#x524D;&#x6D88;&#x8D39;&#x7684;&#x5206;&#x533A;&#x522B;&#x5206;&#x914D;&#x7ED9;&#x5176;&#x4ED6;&#x6D88;&#x8D39;&#x7EC4;&#xFF0C;&#x4F46;&#x662F;&#x6D88;&#x8D39;&#x8005;&#x672C;&#x5730;&#x62C9;&#x53D6;&#x56DE;&#x6765;&#x7684;&#x6D88;&#x606F;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x6D88;&#x8D39;&#xFF0C;&#x5BFC;&#x81F4;&#x6D88;&#x8D39;&#x987A;&#x5E8F;&#x9519;&#x4E71;&#x3002;<strong>&#x9664;&#x975E;&#x5728;&#x6D88;&#x8D39;&#x8FC7;&#x7A0B;&#x4E2D;&#x9501;&#x5B9A;&#x5206;&#x533A;&#xFF0C;&#x4E0D;&#x5206;&#x914D;&#x7ED9;&#x522B;&#x7684;&#x6D88;&#x8D39;&#x8005;</strong>&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#xFF0C;rocketmq&#x5DF2;&#x7ECF;&#x539F;&#x751F;&#x652F;&#x6301;&#xFF0C;&#x5B9E;&#x73B0;&#x4E5F;&#x7C7B;&#x4F3C;&#x3002;</p>
<footer class="page-footer"><span class="copyright">powered by Gitbook</span><span class="footer-modification">&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#xFF1A;
2022-01-25 00:25:01
</span></footer> <link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"> <script>     window.klipse_settings = {         selector: ".language-klipse, .lang-eval-clojure",         selector_eval_js: ".lang-eval-js",         selector_eval_python_client: ".lang-eval-python",         selector_eval_php: ".lang-eval-php",         selector_eval_scheme: ".lang-eval-scheme",         selector_eval_ruby: ".lang-eval-ruby",         selector_reagent: ".lang-reagent",        selector_google_charts: ".lang-google-chart",        selector_es2017: ".lang-eval-es2017",        selector_jsx: ".lang-eval-jsx",        selector_transpile_jsx: ".lang-transpile-jsx",        selector_render_jsx: ".lang-render-jsx",        selector_react: ".lang-react",        selector_eval_markdown: ".lang-render-markdown",        selector_eval_lambdaway: ".lang-render-lambdaway",        selector_eval_cpp: ".lang-eval-cpp",        selector_eval_html: ".lang-render-html",        selector_sql: ".lang-eval-sql",        selector_brainfuck: "lang-eval-brainfuck",        selector_js: ".lang-transpile-cljs"    }; </script> <script src="https://storage.googleapis.com/app.klipse.tech/plugin/js/klipse_plugin.js"></script>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ElasticSearch快速入门.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: ElasticSearch轻松入门">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"消息队列高手课","level":"1.2.1.3","depth":3,"next":{"title":"存储","level":"1.2.2","depth":2,"ref":"","articles":[{"title":"【WIP】mysql","level":"1.2.2.1","depth":3,"ref":"","articles":[]}]},"previous":{"title":"ElasticSearch轻松入门","level":"1.2.1.2","depth":3,"path":"pages/server/ElasticSearch快速入门.md","ref":"pages/server/ElasticSearch快速入门.md","articles":[]},"dir":"ltr"},"config":{"plugins":["chapter-fold","expandable-chapters-small","expandable-chapters","advanced-emoji","github","splitter","-sharing","sharing-plus","simple-page-toc","copy-code-button","page-toc-button","klipse","pageview-count","popup","tbfed-pagefooter","-highlight"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"","modify_label":"修改时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"prism":{"css":["prismjs/themes/prism-dracula.css"]},"github":{"url":"https://github.com/oubindo"},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"page-toc-button":{"maxTocDepth":3,"minTocSize":3},"pageview-count":{},"expandable-chapters-small":{},"copy-code-button":{},"klipse":{"myConfigKey":"it's the default value"},"advanced-emoji":{"embedEmojis":false},"sharing":{"douban":true,"google":false,"twitter":false,"weibo":true,"all":["google","twitter","weibo"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","author":"oubindo","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"码上有为","links":{"sharing":{"all":null,"facebook":null,"google":null,"twitter":null,"weibo":null},"sidebar":{"公众号:码上有为":"https://mp.weixin.qq.com/s/RnGl2FntihqrK0g2mb2aWw"}},"gitbook":"*","description":"码上有为的编程人生","extension":null},"file":{"path":"pages/server/消息队列高手课.md","mtime":"2022-01-24T16:25:01.722Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-01-24T16:27:16.494Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-copy-code-button/toggle.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

